In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                'key2': ['one', 'two', 'one', 'two', 'one'],
                'data1': np.random.randn(5),
                'data2': np.random.randn(5)})
df

      data1     data2 key1 key2
0 -0.525012 -2.216043    a  one
1  0.010601  0.677416    a  two
2 -0.409187  0.602563    b  one
3 -0.245064 -1.499773    b  two
4  1.088180 -0.212477    a  one

In [3]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a    0.191256
b   -0.327125
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.281584
      two     0.010601
b     one    -0.409187
      two    -0.245064
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a     0.281584  0.010601
b    -0.409187 -0.245064

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.010601
            2006   -0.409187
Ohio        2005   -0.385038
            2006    1.088180
Name: data1, dtype: float64

In [8]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.191256 -0.583702
b    -0.327125 -0.448605

In [9]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.281584 -1.214260
     two   0.010601  0.677416
b    one  -0.409187  0.602563
     two  -0.245064 -1.499773

In [11]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [13]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.525012 -2.216043    a  one
1  0.010601  0.677416    a  two
4  1.088180 -0.212477    a  one
b
      data1     data2 key1 key2
2 -0.409187  0.602563    b  one
3 -0.245064 -1.499773    b  two

In [14]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0 -0.525012 -2.216043    a  one
4  1.088180 -0.212477    a  one
a two
      data1     data2 key1 key2
1  0.010601  0.677416    a  two
b one
      data1     data2 key1 key2
2 -0.409187  0.602563    b  one
b two
      data1     data2 key1 key2
3 -0.245064 -1.499773    b  two

In [16]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

      data1     data2 key1 key2
2 -0.409187  0.602563    b  one
3 -0.245064 -1.499773    b  two

In [19]:
people = DataFrame(np.random.randn(5, 5),
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Traivs'])
people.loc[2:3, ['b', 'c']] = np.nan

In [20]:
people

               a         b         c         d         e
Joe    -1.040494 -0.258426 -0.440547 -0.682998 -0.818588
Steve   2.252803 -0.398714  0.878190  0.603494  1.500748
Wes     0.310261       NaN       NaN  0.380011 -0.360400
Jim    -0.549361  1.277000  0.869187 -1.064941 -1.239165
Traivs -1.185428  1.255642  1.065803  0.633585 -1.727546

In [21]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe    -1.123546 -2.117508
Steve   1.481684  3.354837
Wes     0.380011 -0.050139
Jim    -0.195754 -0.511526
Traivs  1.699388 -1.657332

In [22]:
map_series = Series(mapping)
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Traivs     2    3

In [23]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.279594  1.018574  0.428640 -1.367928 -2.418153
5  2.252803 -0.398714  0.878190  0.603494  1.500748
6 -1.185428  1.255642  1.065803  0.633585 -1.727546